README.md
```mermaid
sequenceDiagram
		participant App
		participant Logger
		participant Appender
		participant Console
		participant File

		App->>Logger: log(level, "message")
		Logger->>LogMessage: new LogMessage(level, service, message)
		Logger->>Appender: append(logMessage)
		Appender-->>Console: write(...) (ConsoleAppender)
		Appender-->>File: write(...) (FileAppender)
```
